/**
 * ================================================================
 * MessageConfig.js
 * 사업별 이메일 / SMS 메시지 템플릿 설정
 * ================================================================
 */

const { ACCOUNT_CONFIG } = require("../../../security_info.js")

const MESSAGE_CONFIG = {

    // -------------------------------------------------------------
    // 강원SW미래채움 (GW)
    // -------------------------------------------------------------

    GW: {

        ORGANIZATION: "강원SW미래채움",
        SENDER_NAME: "강원SW미래채움",

        CONTACT_LINK: ACCOUNT_CONFIG.GW.CONTACT_LINK,

        // 이메일 제목
        EMAIL_SUBJECT:
            "[{ORGANIZATION}] {DATE} {LOCATION} 교육 리마인드 안내",

        // 이메일 본문
        EMAIL_BODY:
`안녕하세요 {INSTRUCTOR} 강사님. {ORGANIZATION} 운영국입니다.

{DATE} 교육 일정을 안내드립니다.
아래 세부 일정을 확인해주시기 바랍니다.

--------------------------------------------------
■ 교육 일자 : {DATE}
■ 수요처명 : {LOCATION}
■ 교육 일정 :
{CLASS_SCHEDULE}
--------------------------------------------------

※ 문의사항
: {CONTACT_LINK}
플러스 친구 채팅으로 문의바랍니다.

감사합니다.

{ORGANIZATION} 운영사무국 드림`,

// --------------------------------------------------------------
        // SMS 제목
        SMS_SUBJECT:
            "[강원SW미래채움] 강의 리마인드",

        // SMS 본문
        SMS_BODY:
`안녕하세요 {INSTRUCTOR} 강사님.
{ORGANIZATION} 운영국입니다.

{DATE} 교육 일정을 안내드립니다.
아래 세부 일정을 확인해주시기 바랍니다.

--------------------------------------------------
■ 교육 일자 : {DATE}
■ 수요처명 : {LOCATION}
■ 교육 일정 :
{CLASS_SCHEDULE}
--------------------------------------------------

※ 문의사항
: {CONTACT_LINK}
플러스 친구 채팅으로 문의바랍니다.

감사합니다.

{ORGANIZATION} 운영사무국 드림`,
    }
};

module.exports = MESSAGE_CONFIG;